Revit 2027 API
FillGrid.GetSegments Method
 Gets the segments of the fill grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetSegments()
Public Function GetSegments As IList(Of Double)
public:
IList<double>^ GetSegments()
member GetSegments : unit -> IList<float>
Return Value
IList<Double>
 The segments.
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace